namespace ChatBotForServices.Data;
public static class ChattyFAQ
{
        public static readonly Dictionary<string, string> Data = new()
        {
        { "ขออนุมัติสิทธิ์การใช้งาน", @"กรุณาแจ้งรายละเอียดกับทางเจ้าหน้าที่กิจกรรมที่ 2 ทางกลุ่ม Line ดังนี้ครับ
1. ชื่อศูนย์
2. จังหวัด
3. Email
จะมีเจ้าหน้าที่ให้ความช่วยเหลือครับ" },

        { "เปิด app dcc แล้วจอดำ", "เกิดตอนที่อัพเดทเวอร์ชัน app dcc แล้วมีแคชดาต้า ทำงานค้าง วิธีแก้คือให้ทำการเคลียร์แคชเอง โดยที่ทางบริษัทจะปรับให้ไม่ต้องให้เข้ามาเคลียร์แคช" },

        { "เปิด app dcc แล้วจอขาว", "จากการวิเคราะห์เบื้องต้น น่าจะเกิดจากหน่วยความจำของโทรศัพท์มันเต็ม การแก้ไขเบื้องต้น คือให้ Restart โทรศัพท์ 1 รอบก็กลับมาใช้งานได้ปกติ" },

        { "อยากรู้ขั้นตอนการติดตั้งโปรแกรม Netka", "คุณสามารถดาวน์โหลดไฟล์ติดตั้งโปรแกรม Netka ได้ที่ https://drive.google.com/drive/folders/1sThhT9NNqXbga4G90kzkZeLvPFOIOF3-?usp=sharing แล้วรันไฟล์ NETKA_Setup.cmd ด้วยสิทธิ์ผู้ดูแลระบบ" },

        { "ลงเวลา สแกนหน้าแล้วขึ้นเกิดข้อผิดพลาด", "ให้อัปเดต app dcc เป็นเวอร์ชันล่าสุด: https://decms.dcc.onde.go.th/apk/dcc_admin_123.apk" },

        { "ไม่สามารถสแกนหน้าลงเวลาได้", "รบกวนลอง Restart เครื่องแล้วลงเวลาอีกครั้ง" },

        { "อินเตอร์เนตใช้งานไม่ได้", "ติดต่อเจ้าหน้าที่กิจกรรมที่ 1 หรือ HR ของท่าน" },

        { "อินเตอร์เนต Wifi ใช้งานไม่ได้", "ติดต่อเจ้าหน้าที่กิจกรรมที่ 1 หรือ HR ของท่าน" },

        { "คอมเปิดไม่ติด", @"ทำการตรวจสอบระบบไฟฟ้า เสียบปลั๊กหรือไม่
ถ้ายังแก้ปัญหาไม่ได้ ติดต่อเจ้าหน้าที่กิจกรรมที่ 1 หรือ HR ของท่าน" },

        { "ยังไม่ได้", "ติดต่อเจ้าหน้าที่กิจกรรมที่ 2 ที่หมายเลข 02-114-8592" },

        { "แสกนออกงานไม่ได้", "รบกวนลอง Restart เครื่องแล้วลงเวลาอีกครั้ง" },

        { "ยังแก้ปัญหาไม่ได้", "ติดต่อเจ้าหน้าที่กิจกรรมที่ 2 ที่หมายเลข 02-114-8592" },

        { "ปัญหายังไม่ได้รับการแก้ไข", "ติดต่อเจ้าหน้าที่กิจกรรมที่ 2 ที่หมายเลข 02-114-8592" },

        { "ไม่สามารถเช็คอินในแอป DCC ได้", "รบกวนลอง Restart เครื่องแล้วลงเวลาอีกครั้ง" },

        { "ติดต่อเจ้าหน้าที่กิจกรรมที่ 2", "ติดต่อเจ้าหน้าที่กิจกรรมที่ 2 ที่หมายเลข 02-114-8592" },

        { "ติดตั้งโปรแกรม Netka", "คุณสามารถดาวน์โหลดไฟล์ติดตั้งโปรแกรม Netka ได้ที่ https://drive.google.com/drive/folders/1sThhT9NNqXbga4G90kzkZeLvPFOIOF3-?usp=sharing แล้วรันไฟล์ NETKA_Setup.cmd ด้วยสิทธิ์ผู้ดูแลระบบ" },

        { "ไม่ได้รับรหัส OTP", "ให้ตรวจสอบในกล่องจดหมายขยะ หรือ email ขยะ ครับ" },

        { "สมาร์ทบอร์ด", "กรุณาติดต่อ HR หรือ Line กลุ่มจังหวัด กลุ่มแจ้งซ่อมของกิจกรรมที่ 1 ครับ" },

        { "สแกนเข้างานแล้วขึ้นออกงาน", @"สาเหตุมาจากมีการกด ""ลงเวลาเข้างาน"" 2 ครั้ง คุณสามารถกด ""ลงเวลาออกงาน"" อีกครั้งได้เลยครับ" },

        { "ติดตั้งโปรแกรม Netka แล้วพบปัญหา ขึ้นจอฟ้า", @"เมื่อขึ้นข้อความ ""Windows protected your PC"" หรือ ""จอฟ้า""
1. คลิกที่ ""More info""
2. คลิกที่ ""Run anyway"" และยืนยัน ""Yes"" ครับ" },

        { "โทรศัพท์", "คุณมีปัญหาเกี่ยวกับโทรศัพท์ ใช่หรือไม่ ช่วยระบุปัญหาให้ชัดเจนครับ เช่น สูญหาย, ชาร์จไม่เข้า, หน้าจอแตก, เปิดไม่ติด" },

        { "โทรศัพท์สูญหาย", @"1. ประสานงานเจ้าหน้าที่กิจกรรมที่ 2 หรือแจ้ง HR-กิจกรรมที่ 1
2. ไปแจ้งความที่สถานีตำรวจใกล้บ้านเพื่อเป็นหลักฐาน" },

        { "โทรศัพท์หาย", @"1. ประสานงานเจ้าหน้าที่กิจกรรมที่ 2 หรือแจ้ง HR-กิจกรรมที่ 1
2. ไปแจ้งความที่สถานีตำรวจใกล้บ้านเพื่อเป็นหลักฐาน" },

        { "โทรศัพท์มือถือหาย", @"1. ประสานงานเจ้าหน้าที่กิจกรรมที่ 2 หรือแจ้ง HR-กิจกรรมที่ 1
2. ไปแจ้งความที่สถานีตำรวจใกล้บ้านเพื่อเป็นหลักฐาน" },

        { "โทรศัพท์มือถือชาร์จไม่เข้า", "ติดต่อเจ้าหน้าที่กิจกรรมที่ 2 โทร 02-114-8592 หรือทางกลุ่ม Line" },

        { "โทรศัพท์มือถือหน้าจอแตก", "ติดต่อเจ้าหน้าที่กิจกรรมที่ 2 โทร 02-114-8592 หรือทางกลุ่ม Line" },

        { "โทรศัพท์จอแตก", "ติดต่อเจ้าหน้าที่กิจกรรมที่ 2 โทร 02-114-8592 หรือทางกลุ่ม Line" },

        { "โทรศัพท์มือถือเปิดไม่ติด", "ติดต่อเจ้าหน้าที่กิจกรรมที่ 2 โทร 02-114-8592 หรือทางกลุ่ม Line" },

        { "โต๊ะพัง", "ติดต่อเจ้าหน้าที่กิจกรรมที่ 1 หรือ HR ของท่าน" }
        };
}
